# 4.3 Тернарный условный оператор

a = 12
b = 7

res = a if a > b else b
print(res)

res1 = a + 2 if a > b else b - 4
print(res1)

res2 = abs(a) if a < b else abs(b)
print(res2)

s = "python"
t = "upper"

res3 = s.upper() if t == 'upper' else s
print(res3)

lst = [1, 2, a if a < b else b, 4, 5]
print(lst)

s1 = "a - " + ("четное" if a % 2 == 0 else "нечетное") + " число"
print(s1)

m1 = max(1, 5, a if a > 0 else b, 4, 5)
print(m1)

print('\n' + "вложенные тернарные операторы")
a = 2
b = 3
c = -4

d = (a if a > c else c) if a > b else (b if b > c else c)
print(d)

# Tasks

# Task 6
# Подвиг 6. Имеется список базовых нот:
#
# m = ['до', 'ре', 'ми', 'фа', 'соль', 'ля', 'си']
#
# Вводятся три целых числа в диапазоне от 1 до 7 - номера нот,
# в одну строчку через пробел. Необходимо отобразить указанные ноты в виде строки через пробел,
# но перед нотами до и фа дополнительно ставить символ диеза '#'.
# Реализовать эту программу с использованием тернарного условного оператора (он может использоваться несколько раз).
#
# Sample Input:
#
# 1 6 7
# Sample Output:
#
# #до ля си
#
# # Variant 1
# m = ['до', 'ре', 'ми', 'фа', 'соль', 'ля', 'си']
# n = list(map(int, input("Введите номера нот: ").split()))
# m[0], m[3] = "#до", "#фа"
# # print(m[1::2])
# print(m[n[0] - 1], m[n[1] - 1], m[n[2] - 1])
# # Variant 2
# d1, d2, d3 = map(int, input().split())
# m = ['до', 'ре', 'ми', 'фа', 'соль', 'ля', 'си']
#
# print('#' + m[d1-1] if m[d1-1] in ['до', 'фа'] else m[d1-1],
#       '#' + m[d2-1] if m[d2-1] in ['до', 'фа'] else m[d2-1],
#       '#' + m[d3-1] if m[d3-1] in ['до', 'фа'] else m[d3-1])
